MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX440F128L.PIC
      <edc:SFRDef edc:_addr="0x1F805220" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C2ADD" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C2ADD" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2 I2C98zy">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C98zyADD"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CADD" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="I2CADD" edc:nzwidth="0xa"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805230" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="----------------------nnnnnnnnnn" edc:cname="I2C2MSK" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------0000000000" edc:name="I2C2MSK" edc:nzwidth="0x20" edc:por="----------------------0000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2 I2C98zy">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C98zyMSK"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CMSK" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="I2CMSK" edc:nzwidth="0xa"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805240" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="--------------------nnnnnnnnnnnn" edc:cname="I2C2BRG" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="I2C2BRG" edc:nzwidth="0x20" edc:por="--------------------000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2 I2C98zy">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C98zyBRG"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CBRG" edc:desc="" edc:islanghidden="true" edc:mask="0xfff" edc:name="I2CBRG" edc:nzwidth="0xc"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805250" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="I2C2TRN" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C2TRN" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="I2C2 I2C98zy">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C98zyTRN"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CTRN" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="I2CTRN" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805260" edc:_begin="0x0" edc:_end="0x70" edc:_modsrc="DOS-00774_i2c_pb_v1.Module" edc:_refcount="2" edc:access="------------------------nnnnnnnn" edc:cname="I2C2RCV" edc:desc="" edc:grp="I2C" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="I2C2RCV" edc:nzwidth="0x20" edc:por="------------------------00000000" edc:portals="- - -" ltx:memberofperipheral="I2C2 I2C98zy">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="I2C98zyRCV"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2CRCV" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="I2CRCV" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F805270" edc:offset="1424"/>
      <edc:SFRDef edc:_addr="0x1F805800" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-00753_spi_pb_v1.Module" edc:_refcount="1" edc:access="nnn-----------n-nnnnnnnnnnn-----" edc:cname="SPI1CON" edc:desc="" edc:grp="SPI" edc:impl="0xe0fefff0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----------0-00000000000-----" edc:name="SPI1CON" edc:nzwidth="0x20" edc:por="000-----------0-00000000000-----" edc:portals="CLR SET INV" ltx:baseofperipheral="SPI1 SPI99zz">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="SPI99zzCON"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MSTEN" edc:desc="" edc:mask="0x1" edc:name="MSTEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKP" edc:desc="" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SSEN" edc:desc="" edc:mask="0x1" edc:name="SSEN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CKE" edc:desc="" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SMP" edc:desc="" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE16" edc:desc="" edc:mask="0x1" edc:name="MODE16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE32" edc:desc="" edc:mask="0x1" edc:name="MODE32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DISSDO" edc:desc="" edc:mask="0x1" edc:name="DISSDO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIDL" edc:desc="" edc:mask="0x1" edc:name="SIDL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRZ" edc:desc="" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="FRZ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPIFE" edc:desc="" edc:mask="0x1" edc:name="SPIFE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FRMPOL" edc:desc="" edc:mask="0x1" edc:name="FRMPOL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMSYNC" edc:desc="" edc:mask="0x1" edc:name="FRMSYNC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRMEN" edc:desc="" edc:mask="0x1" edc:name="FRMEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="SPI 1" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805810" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-00753_spi_pb_v1.Module" edc:_refcount="1" edc:access="--------------------r----r--r--r" edc:cname="SPI1STAT" edc:desc="" edc:grp="SPI" edc:impl="0xe0e0fe5d" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------0----0--0--0" edc:name="SPI1STAT" edc:nzwidth="0x20" edc:por="--------------------0----0--0--0" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1 SPI99zz">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="SPI99zzSTAT"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPIRBF" edc:desc="" edc:mask="0x1" edc:name="SPIRBF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPITBE" edc:desc="" edc:mask="0x1" edc:name="SPITBE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPIROV" edc:desc="" edc:mask="0x1" edc:name="SPIROV" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPIBUSY" edc:desc="" edc:mask="0x1" edc:name="SPIBUSY" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805820" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-00753_spi_pb_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="SPI1BUF" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="SPI1BUF" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="SPI1 SPI99zz">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="SPI99zzBUF"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BUF" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="SPI1BUF" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F805830" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-00753_spi_pb_v1.Module" edc:_refcount="1" edc:access="-----------------------nnnnnnnnn" edc:cname="SPI1BRG" edc:desc="" edc:grp="SPI" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------------------000000000" edc:name="SPI1BRG" edc:nzwidth="0x20" edc:por="-----------------------000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="SPI1 SPI99zz">
        <edc:AliasList>
          <edc:LegacyAlias edc:cname="SPI99zzBRG"/>
        </edc:AliasList>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SPI1BRG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="SPI1BRG" edc:nzwidth="0x9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
